Revit 2024 API
BasePoint Class
 A class representing the Project Base Point and Survey Point. Each Revit project contains one project base point and one survey point. The project base point represents the origin of the project coordinate system. The survey point represents the origin of the shared coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class BasePoint : Element
Visual Basic
Public Class BasePoint _
	Inherits Element
Visual C++
public ref class BasePoint : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.BasePoint
See Also
BasePoint Members
Autodesk.Revit.DB Namespace